############################################################################
# XEM7360 - Xilinx constraints file
#
# Pin mappings for the XEM7360.  Use this as a template and comment out 
# the pins that are not used in your design.  (By default, map will fail
# if this file contains constraints for signals not in your design).
#
# Copyright (c) 2004-2016 Opal Kelly Incorporated
############################################################################

set_property CFGBVS GND [current_design]
set_property CONFIG_VOLTAGE 1.8 [current_design]
set_property BITSTREAM.GENERAL.COMPRESS True [current_design]

############################################################################
## FrontPanel Host Interface
############################################################################
set_property PACKAGE_PIN F23 [get_ports {okHU[0]}]
set_property PACKAGE_PIN H23 [get_ports {okHU[1]}]
set_property PACKAGE_PIN J25 [get_ports {okHU[2]}]
set_property SLEW FAST [get_ports {okHU[*]}]
set_property IOSTANDARD LVCMOS18 [get_ports {okHU[*]}]

set_property PACKAGE_PIN F22 [get_ports {okUH[0]}]
set_property PACKAGE_PIN G24 [get_ports {okUH[1]}]
set_property PACKAGE_PIN J26 [get_ports {okUH[2]}]
set_property PACKAGE_PIN G26 [get_ports {okUH[3]}]
set_property PACKAGE_PIN C23 [get_ports {okUH[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {okUH[*]}]

set_property PACKAGE_PIN B21 [get_ports {okUHU[0]}]
set_property PACKAGE_PIN C21 [get_ports {okUHU[1]}]
set_property PACKAGE_PIN E22 [get_ports {okUHU[2]}]
set_property PACKAGE_PIN A20 [get_ports {okUHU[3]}]
set_property PACKAGE_PIN B20 [get_ports {okUHU[4]}]
set_property PACKAGE_PIN C22 [get_ports {okUHU[5]}]
set_property PACKAGE_PIN D21 [get_ports {okUHU[6]}]
set_property PACKAGE_PIN C24 [get_ports {okUHU[7]}]
set_property PACKAGE_PIN C26 [get_ports {okUHU[8]}]
set_property PACKAGE_PIN D26 [get_ports {okUHU[9]}]
set_property PACKAGE_PIN A24 [get_ports {okUHU[10]}]
set_property PACKAGE_PIN A23 [get_ports {okUHU[11]}]
set_property PACKAGE_PIN A22 [get_ports {okUHU[12]}]
set_property PACKAGE_PIN B22 [get_ports {okUHU[13]}]
set_property PACKAGE_PIN A25 [get_ports {okUHU[14]}]
set_property PACKAGE_PIN B24 [get_ports {okUHU[15]}]
set_property PACKAGE_PIN G21 [get_ports {okUHU[16]}]
set_property PACKAGE_PIN E23 [get_ports {okUHU[17]}]
set_property PACKAGE_PIN E21 [get_ports {okUHU[18]}]
set_property PACKAGE_PIN H22 [get_ports {okUHU[19]}]
set_property PACKAGE_PIN D23 [get_ports {okUHU[20]}]
set_property PACKAGE_PIN J21 [get_ports {okUHU[21]}]
set_property PACKAGE_PIN K22 [get_ports {okUHU[22]}]
set_property PACKAGE_PIN D24 [get_ports {okUHU[23]}]
set_property PACKAGE_PIN K23 [get_ports {okUHU[24]}]
set_property PACKAGE_PIN H24 [get_ports {okUHU[25]}]
set_property PACKAGE_PIN F24 [get_ports {okUHU[26]}]
set_property PACKAGE_PIN D25 [get_ports {okUHU[27]}]
set_property PACKAGE_PIN J24 [get_ports {okUHU[28]}]
set_property PACKAGE_PIN B26 [get_ports {okUHU[29]}]
set_property PACKAGE_PIN H26 [get_ports {okUHU[30]}]
set_property PACKAGE_PIN E26 [get_ports {okUHU[31]}]
set_property SLEW FAST [get_ports {okUHU[*]}]
set_property IOSTANDARD LVCMOS18 [get_ports {okUHU[*]}]

set_property PACKAGE_PIN R26 [get_ports {okAA}]
set_property IOSTANDARD LVCMOS33 [get_ports {okAA}]


create_clock -name okUH0 -period 9.920 [get_ports {okUH[0]}]

set_input_delay -add_delay -max -clock [get_clocks {okUH0}]  8.000 [get_ports {okUH[*]}]
set_input_delay -add_delay -min -clock [get_clocks {okUH0}] 10.000 [get_ports {okUH[*]}]
set_multicycle_path -setup -from [get_ports {okUH[*]}] 2

set_input_delay -add_delay -max -clock [get_clocks {okUH0}]  8.000 [get_ports {okUHU[*]}]
set_input_delay -add_delay -min -clock [get_clocks {okUH0}]  2.000 [get_ports {okUHU[*]}]
set_multicycle_path -setup -from [get_ports {okUHU[*]}] 2

set_output_delay -add_delay -max -clock [get_clocks {okUH0}]  2.000 [get_ports {okHU[*]}]
set_output_delay -add_delay -min -clock [get_clocks {okUH0}]  -0.500 [get_ports {okHU[*]}]

set_output_delay -add_delay -max -clock [get_clocks {okUH0}]  2.000 [get_ports {okUHU[*]}]
set_output_delay -add_delay -min -clock [get_clocks {okUH0}]  -0.500 [get_ports {okUHU[*]}]


############################################################################
## System Clock
############################################################################
set_property IOSTANDARD LVDS [get_ports {sys_clkp}]
set_property PACKAGE_PIN AB11 [get_ports {sys_clkp}]

set_property IOSTANDARD LVDS [get_ports {sys_clkn}]
set_property PACKAGE_PIN AC11 [get_ports {sys_clkn}]

create_clock -name sys_clk -period 5 [get_ports sys_clkp]

#added by seoeun
#create_clock -name clk -period 6.6 [get_ports clk]
create_clock -name clk -period 8.7 [get_ports clk]

#create_generated_clock -name clk_dly \
#  -source [get_clocks clk] \
#  -edges {0 1 2} \
#  -edge_shift {-0.2525 -0.2525 -0.2525} \
#  [get_pins inst_clk_wiz/clk_out1]


#added clk by seoeun
#set_clock_groups -asynchronous -group [get_clocks {sys_clk}] -group [get_clocks {okUH0}] -group [get_clocks {clk}]
set_clock_groups -asynchronous -group [get_clocks {sys_clk}] -group [get_clocks {mmcm0_clk0 okUH0}] -group [get_clocks {clk clk_out1_clk_wiz_1}]
############################################################################
## User Reset
############################################################################
set_property PACKAGE_PIN G22 [get_ports {reset}]
set_property IOSTANDARD LVCMOS18 [get_ports {reset}]
set_property SLEW FAST [get_ports {reset}]


# MC1-1 
set_property PACKAGE_PIN B17 [get_ports {clk_fpga}]
set_property IOSTANDARD LVCMOS18 [get_ports {clk_fpga}]
# MC1-3 
set_property PACKAGE_PIN A17 [get_ports {data[26]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[26]}]
# MC1-4 
set_property PACKAGE_PIN B19 [get_ports {data[27]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[27]}]
# MC1-7 
set_property PACKAGE_PIN G17 [get_ports {data[28]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[28]}]
# MC1-8 
set_property PACKAGE_PIN A18 [get_ports {data[29]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[29]}]
# MC1-9 
set_property PACKAGE_PIN F18 [get_ports {data[30]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[30]}]
# MC1-10 
set_property PACKAGE_PIN A19 [get_ports {data[31]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[31]}]
# MC1-13 
set_property PACKAGE_PIN G19 [get_ports {data[32]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[32]}]
# MC1-14 
set_property PACKAGE_PIN E15 [get_ports {data[33]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[33]}]
# MC1-15 
set_property PACKAGE_PIN F20 [get_ports {data[34]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[34]}]
# MC1-16 
set_property PACKAGE_PIN E16 [get_ports {data[35]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[35]}]
# MC1-19 
set_property PACKAGE_PIN F19 [get_ports {data[36]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[36]}]
# MC1-20 
set_property PACKAGE_PIN H19 [get_ports {data[37]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[37]}]
# MC1-21 
set_property PACKAGE_PIN E20 [get_ports {data[38]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[38]}]
# MC1-22 
set_property PACKAGE_PIN G20 [get_ports {data[39]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[39]}]
# MC1-25 
set_property PACKAGE_PIN F17 [get_ports {data[40]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[40]}]
# MC1-26 
set_property PACKAGE_PIN C17 [get_ports {data[41]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[41]}]
# MC1-27 
set_property PACKAGE_PIN E17 [get_ports {data[42]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[42]}]
# MC1-28 
set_property PACKAGE_PIN C18 [get_ports {data[43]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[43]}]
# MC1-29 
set_property PACKAGE_PIN K15 [get_ports {data[44]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[44]}]
# MC1-30 
set_property PACKAGE_PIN D15 [get_ports {data[45]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[45]}]
# MC1-31 
set_property PACKAGE_PIN L19 [get_ports {data[46]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[46]}]
# MC1-32 
set_property PACKAGE_PIN C16 [get_ports {data[47]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[47]}]
# MC1-33 
set_property PACKAGE_PIN L20 [get_ports {data[48]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[48]}]
# MC1-34 
set_property PACKAGE_PIN B16 [get_ports {data[49]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[49]}]
# MC1-35 
set_property PACKAGE_PIN M17 [get_ports {data[50]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[50]}]
# MC1-36 
set_property PACKAGE_PIN K20 [get_ports {data[51]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[51]}]
# MC1-37 
set_property PACKAGE_PIN J18 [get_ports {data[52]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[52]}]
# MC1-38 
set_property PACKAGE_PIN H17 [get_ports {data[53]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[53]}]
# MC1-39 
set_property PACKAGE_PIN J19 [get_ports {data[54]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[54]}]
# MC1-40 
set_property PACKAGE_PIN H18 [get_ports {data[55]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[55]}]
# MC1-41 
set_property PACKAGE_PIN L18 [get_ports {data[56]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[56]}]
# MC1-42 
set_property PACKAGE_PIN K18 [get_ports {data[57]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[57]}]
# MC1-43 
set_property PACKAGE_PIN G15 [get_ports {data[58]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[58]}]
# MC1-44 
set_property PACKAGE_PIN D19 [get_ports {data[59]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[59]}]
# MC1-45 
set_property PACKAGE_PIN F15 [get_ports {data[60]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[60]}]
# MC1-46 
set_property PACKAGE_PIN D20 [get_ports {data[61]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[61]}]
# MC1-47 
set_property PACKAGE_PIN L17 [get_ports {data[62]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[62]}]
# MC1-48 
set_property PACKAGE_PIN M16 [get_ports {data[63]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[63]}]
# MC1-49 
set_property PACKAGE_PIN H16 [get_ports {data[64]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[64]}]
# MC1-50 
set_property PACKAGE_PIN E18 [get_ports {data[65]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[65]}]
# MC1-51 
set_property PACKAGE_PIN G16 [get_ports {data[66]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[66]}]
# MC1-52 
set_property PACKAGE_PIN D18 [get_ports {data[67]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[67]}]
# MC1-55 
set_property PACKAGE_PIN K16 [get_ports {data[68]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[68]}]
# MC1-56 
set_property PACKAGE_PIN J15 [get_ports {data[69]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[69]}]
# MC1-57 
set_property PACKAGE_PIN K17 [get_ports {data[70]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[70]}]
# MC1-58 
set_property PACKAGE_PIN J16 [get_ports {data[71]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[71]}]
# MC1-61 
set_property PACKAGE_PIN E11 [get_ports {data[72]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[72]}]
# MC1-62 
set_property PACKAGE_PIN H14 [get_ports {data[73]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[73]}]
# MC1-63 
set_property PACKAGE_PIN D11 [get_ports {data[74]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[74]}]
# MC1-64 
set_property PACKAGE_PIN G14 [get_ports {data[75]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[75]}]
# MC1-67 
set_property PACKAGE_PIN J13 [get_ports {data[76]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[76]}]
# MC1-68 
set_property PACKAGE_PIN G12 [get_ports {data[77]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[77]}]
# MC1-69 
set_property PACKAGE_PIN H13 [get_ports {data[78]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[78]}]
# MC1-70 
set_property PACKAGE_PIN F12 [get_ports {data[79]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[79]}]
# MC1-73 
set_property PACKAGE_PIN D14 [get_ports {data[80]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[80]}]
# MC1-74 
set_property PACKAGE_PIN F14 [get_ports {data[81]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[81]}]
# MC1-85 
set_property PACKAGE_PIN E10 [get_ports {data[82]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[82]}]
# MC1-86 
set_property PACKAGE_PIN C12 [get_ports {data[83]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[83]}]
# MC1-87 
set_property PACKAGE_PIN D10 [get_ports {data[84]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[84]}]
# MC1-88 
set_property PACKAGE_PIN C11 [get_ports {data[85]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[85]}]
# MC1-89 
set_property PACKAGE_PIN J8 [get_ports {data[86]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[86]}]
# MC1-90 
set_property PACKAGE_PIN B15 [get_ports {data[87]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[87]}]
# MC1-91 
set_property PACKAGE_PIN D9 [get_ports {data[88]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[88]}]
# MC1-92 
set_property PACKAGE_PIN B14 [get_ports {data[89]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[89]}]
# MC1-93 
set_property PACKAGE_PIN D8 [get_ports {data[90]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[90]}]
# MC1-94 
set_property PACKAGE_PIN A14 [get_ports {data[91]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[91]}]
# MC1-95 
set_property PACKAGE_PIN A13 [get_ports {data[92]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[92]}]
# MC1-96 
set_property PACKAGE_PIN A15 [get_ports {data[93]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[93]}]
# MC1-97 
set_property PACKAGE_PIN F9 [get_ports {data[94]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[94]}]
# MC1-98 
set_property PACKAGE_PIN G11 [get_ports {data[95]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[95]}]
# MC1-99 
set_property PACKAGE_PIN F8 [get_ports {data[96]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[96]}]
# MC1-100 
set_property PACKAGE_PIN F10 [get_ports {data[97]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[97]}]
# MC1-101 
set_property PACKAGE_PIN A12 [get_ports {data[98]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[98]}]
# MC1-102 
set_property PACKAGE_PIN J14 [get_ports {data[99]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[99]}]
# MC1-103 
set_property PACKAGE_PIN J11 [get_ports {data[100]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[100]}]
# MC1-104 
set_property PACKAGE_PIN B10 [get_ports {data[101]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[101]}]
# MC1-105 
set_property PACKAGE_PIN J10 [get_ports {data[102]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[102]}]
# MC1-106 
set_property PACKAGE_PIN A10 [get_ports {data[103]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[103]}]
# MC1-107 
set_property PACKAGE_PIN H12 [get_ports {data[104]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[104]}]
# MC1-108 
set_property PACKAGE_PIN C14 [get_ports {data[105]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[105]}]
# MC1-109 
set_property PACKAGE_PIN G10 [get_ports {data[106]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[106]}]
# MC1-110 
set_property PACKAGE_PIN C9 [get_ports {data[107]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[107]}]
# MC1-111 
set_property PACKAGE_PIN G9 [get_ports {data[108]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[108]}]
# MC1-112 
set_property PACKAGE_PIN B9 [get_ports {data[109]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[109]}]
# MC1-115 
set_property PACKAGE_PIN H9 [get_ports {data[110]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[110]}]
# MC2-1 
set_property PACKAGE_PIN AE23 [get_ports {data[25]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[25]}]
# MC2-2 
set_property PACKAGE_PIN U26 [get_ports {data[24]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[24]}]
# MC2-3 
set_property PACKAGE_PIN AF23 [get_ports {data[23]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[23]}]
# MC2-4 
set_property PACKAGE_PIN V26 [get_ports {data[22]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[22]}]
# MC2-7 
set_property PACKAGE_PIN AC23 [get_ports {data[21]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[21]}]
# MC2-8 
set_property PACKAGE_PIN V21 [get_ports {data[20]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[20]}]
# MC2-9 
set_property PACKAGE_PIN AC24 [get_ports {data[19]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[19]}]
# MC2-10 
set_property PACKAGE_PIN W21 [get_ports {data[18]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[18]}]
# MC2-13 
set_property PACKAGE_PIN AF24 [get_ports {data[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[17]}]
# MC2-14 
set_property PACKAGE_PIN W25 [get_ports {data[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[16]}]
# MC2-15 
set_property PACKAGE_PIN AF25 [get_ports {data[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[15]}]
# MC2-16 
set_property PACKAGE_PIN W26 [get_ports {data[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[14]}]
# MC2-19 
set_property PACKAGE_PIN Y25 [get_ports {data[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[13]}]
# MC2-20 
set_property PACKAGE_PIN W23 [get_ports {data[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[12]}]
# MC2-21 
set_property PACKAGE_PIN Y26 [get_ports {data[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[11]}]
# MC2-22 
set_property PACKAGE_PIN W24 [get_ports {data[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[10]}]
# MC2-23 
set_property PACKAGE_PIN Y20 [get_ports {data[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[9]}]
# MC2-24 
set_property PACKAGE_PIN AA22 [get_ports {data[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[8]}]
# MC2-25 
set_property PACKAGE_PIN Y23 [get_ports {data[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[7]}]
# MC2-26 
set_property PACKAGE_PIN AB21 [get_ports {data[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[6]}]
# MC2-27 
set_property PACKAGE_PIN AA24 [get_ports {data[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[5]}]
# MC2-28 
set_property PACKAGE_PIN AC21 [get_ports {data[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[4]}]
# MC2-29 
set_property PACKAGE_PIN Y22 [get_ports {data[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[3]}]
# MC2-30 
set_property PACKAGE_PIN V24 [get_ports {data[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[2]}]
# MC2-31 
set_property PACKAGE_PIN AD26 [get_ports {data[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[1]}]
# MC2-32 
set_property PACKAGE_PIN AA25 [get_ports {data[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[0]}]
# MC2-33 
set_property PACKAGE_PIN AE26 [get_ports {generate_keys}]
set_property IOSTANDARD LVCMOS18 [get_ports {generate_keys}]
# MC2-34 
set_property PACKAGE_PIN AB25 [get_ports {encrypt}]
set_property IOSTANDARD LVCMOS18 [get_ports {encrypt}]
# MC2-35 
set_property PACKAGE_PIN U24 [get_ports {execute}]
set_property IOSTANDARD LVCMOS18 [get_ports {execute}]
# MC2-36 
set_property PACKAGE_PIN U25 [get_ports {dram_write_ready}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_write_ready}]
# MC2-37 
set_property PACKAGE_PIN AD25 [get_ports {dram_read_ready}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_read_ready}]
# MC2-38 
set_property PACKAGE_PIN AA23 [get_ports {data_vld}]
set_property IOSTANDARD LVCMOS18 [get_ports {data_vld}]
# MC2-39 
set_property PACKAGE_PIN AE25 [get_ports {command_type}]
set_property IOSTANDARD LVCMOS18 [get_ports {command_type}]
# MC2-40 
set_property PACKAGE_PIN AB24 [get_ports {addr_wvalid}]
set_property IOSTANDARD LVCMOS18 [get_ports {addr_wvalid}]
# MC2-41 
set_property PACKAGE_PIN V23 [get_ports {done}]
set_property IOSTANDARD LVCMOS18 [get_ports {done}]
# MC2-42 
set_property PACKAGE_PIN V22 [get_ports {rstn}]
set_property IOSTANDARD LVCMOS18 [get_ports {rstn}]
# MC2-73 
set_property PACKAGE_PIN AA17 [get_ports {clk}]
set_property IOSTANDARD LVCMOS18 [get_ports {clk}]
# MC2-74 
set_property PACKAGE_PIN V16 [get_ports {dram_addr[19]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[19]}]
# MC2-75 
set_property PACKAGE_PIN AA18 [get_ports {dram_addr[18]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[18]}]
# MC2-76 
set_property PACKAGE_PIN V17 [get_ports {dram_addr[17]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[17]}]
# MC2-79 
set_property PACKAGE_PIN AA14 [get_ports {dram_addr[16]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[16]}]
# MC2-80 
set_property PACKAGE_PIN Y15 [get_ports {dram_addr[15]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[15]}]
# MC2-81 
set_property PACKAGE_PIN AA15 [get_ports {dram_addr[14]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[14]}]
# MC2-82 
set_property PACKAGE_PIN Y16 [get_ports {dram_addr[13]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[13]}]
# MC2-85 
set_property PACKAGE_PIN AB16 [get_ports {dram_addr[12]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[12]}]
# MC2-86 
set_property PACKAGE_PIN AC14 [get_ports {dram_addr[11]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[11]}]
# MC2-87 
set_property PACKAGE_PIN AC16 [get_ports {dram_addr[10]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[10]}]
# MC2-88 
set_property PACKAGE_PIN AD14 [get_ports {dram_addr[9]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[9]}]
# MC2-91 
set_property PACKAGE_PIN AE18 [get_ports {dram_addr[8]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[8]}]
# MC2-92 
set_property PACKAGE_PIN AD20 [get_ports {dram_addr[7]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[7]}]
# MC2-93 
set_property PACKAGE_PIN AF18 [get_ports {dram_addr[6]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[6]}]
# MC2-94 
set_property PACKAGE_PIN AE20 [get_ports {dram_addr[5]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[5]}]
# MC2-95 
set_property PACKAGE_PIN W14 [get_ports {dram_addr[4]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[4]}]
# MC2-96 
set_property PACKAGE_PIN W16 [get_ports {dram_addr[3]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[3]}]
# MC2-97 
set_property PACKAGE_PIN AB17 [get_ports {dram_addr[2]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[2]}]
# MC2-98 
set_property PACKAGE_PIN AC19 [get_ports {dram_addr[1]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[1]}]
# MC2-99 
set_property PACKAGE_PIN AC17 [get_ports {dram_addr[0]}]
set_property IOSTANDARD LVCMOS18 [get_ports {dram_addr[0]}]
# MC2-100 
set_property PACKAGE_PIN AD19 [get_ports {data[127]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[127]}]
# MC2-101 
set_property PACKAGE_PIN V18 [get_ports {data[126]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[126]}]
# MC2-102 
set_property PACKAGE_PIN V19 [get_ports {data[125]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[125]}]
# MC2-103 
set_property PACKAGE_PIN AB14 [get_ports {data[124]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[124]}]
# MC2-104 
set_property PACKAGE_PIN AC18 [get_ports {data[123]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[123]}]
# MC2-105 
set_property PACKAGE_PIN AB15 [get_ports {data[122]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[122]}]
# MC2-106 
set_property PACKAGE_PIN AD18 [get_ports {data[121]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[121]}]
# MC2-107 
set_property PACKAGE_PIN V14 [get_ports {data[120]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[120]}]
# MC2-108 
set_property PACKAGE_PIN W15 [get_ports {data[119]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[119]}]
# MC2-109 
set_property PACKAGE_PIN AF14 [get_ports {data[118]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[118]}]
# MC2-110 
set_property PACKAGE_PIN AB19 [get_ports {data[117]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[117]}]
# MC2-111 
set_property PACKAGE_PIN AF15 [get_ports {data[116]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[116]}]
# MC2-112 
set_property PACKAGE_PIN AB20 [get_ports {data[115]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[115]}]
# MC2-115 
set_property PACKAGE_PIN AD15 [get_ports {data[114]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[114]}]
# MC2-116 
set_property PACKAGE_PIN AA19 [get_ports {data[113]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[113]}]
# MC2-117 
set_property PACKAGE_PIN AE15 [get_ports {data[112]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[112]}]
# MC2-118 
set_property PACKAGE_PIN AA20 [get_ports {data[111]}]
set_property IOSTANDARD LVCMOS18 [get_ports {data[111]}]

# LEDs #####################################################################
set_property PACKAGE_PIN T24 [get_ports {led[0]}]
set_property PACKAGE_PIN T25 [get_ports {led[1]}]
set_property PACKAGE_PIN R25 [get_ports {led[2]}]
set_property PACKAGE_PIN P26 [get_ports {led[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led[*]}]

# Flash ####################################################################
set_property PACKAGE_PIN N17 [get_ports {spi_dq0}]
set_property PACKAGE_PIN N16 [get_ports {spi_c}]
set_property PACKAGE_PIN R16 [get_ports {spi_s}]
set_property PACKAGE_PIN U17 [get_ports {spi_dq1}]
set_property PACKAGE_PIN U16 [get_ports {spi_w_dq2}]
set_property PACKAGE_PIN T17 [get_ports {spi_hold_dq3}]
set_property IOSTANDARD LVCMOS33 [get_ports {spi_dq0}]
set_property IOSTANDARD LVCMOS33 [get_ports {spi_c}]
set_property IOSTANDARD LVCMOS33 [get_ports {spi_s}]
set_property IOSTANDARD LVCMOS33 [get_ports {spi_dq1}]
set_property IOSTANDARD LVCMOS33 [get_ports {spi_w_dq2}]
set_property IOSTANDARD LVCMOS33 [get_ports {spi_hold_dq3}]

# DRAM #####################################################################
set_property PACKAGE_PIN U7 [get_ports {ddr3_dq[0]}]
set_property PACKAGE_PIN W3 [get_ports {ddr3_dq[1]}]
set_property PACKAGE_PIN U5 [get_ports {ddr3_dq[2]}]
set_property PACKAGE_PIN V4 [get_ports {ddr3_dq[3]}]
set_property PACKAGE_PIN U2 [get_ports {ddr3_dq[4]}]
set_property PACKAGE_PIN V6 [get_ports {ddr3_dq[5]}]
set_property PACKAGE_PIN U1 [get_ports {ddr3_dq[6]}]
set_property PACKAGE_PIN V3 [get_ports {ddr3_dq[7]}]
set_property PACKAGE_PIN W1 [get_ports {ddr3_dq[8]}]
set_property PACKAGE_PIN Y1  [get_ports {ddr3_dq[9]}]
set_property PACKAGE_PIN Y2  [get_ports {ddr3_dq[10]}]
set_property PACKAGE_PIN AA3 [get_ports {ddr3_dq[11]}]
set_property PACKAGE_PIN V1 [get_ports {ddr3_dq[12]}]
set_property PACKAGE_PIN AC2 [get_ports {ddr3_dq[13]}]
set_property PACKAGE_PIN V2 [get_ports {ddr3_dq[14]}]
set_property PACKAGE_PIN AB2 [get_ports {ddr3_dq[15]}]
set_property PACKAGE_PIN AD6 [get_ports {ddr3_dq[16]}]
set_property PACKAGE_PIN AB4 [get_ports {ddr3_dq[17]}]
set_property PACKAGE_PIN AC6 [get_ports {ddr3_dq[18]}]
set_property PACKAGE_PIN Y6 [get_ports {ddr3_dq[19]}]
set_property PACKAGE_PIN AC3 [get_ports {ddr3_dq[20]}]
set_property PACKAGE_PIN Y5 [get_ports {ddr3_dq[21]}]
set_property PACKAGE_PIN AC4 [get_ports {ddr3_dq[22]}]
set_property PACKAGE_PIN AA4 [get_ports {ddr3_dq[23]}]
set_property PACKAGE_PIN AF3 [get_ports {ddr3_dq[24]}]
set_property PACKAGE_PIN AF2  [get_ports {ddr3_dq[25]}]
set_property PACKAGE_PIN AE3  [get_ports {ddr3_dq[26]}]
set_property PACKAGE_PIN AE2 [get_ports {ddr3_dq[27]}]
set_property PACKAGE_PIN AE6 [get_ports {ddr3_dq[28]}]
set_property PACKAGE_PIN AE1 [get_ports {ddr3_dq[29]}]
set_property PACKAGE_PIN AE5 [get_ports {ddr3_dq[30]}]
set_property PACKAGE_PIN AD1 [get_ports {ddr3_dq[31]}]
set_property SLEW FAST [get_ports {ddr3_dq[*]}]
set_property IOSTANDARD SSTL15_T_DCI [get_ports {ddr3_dq[*]}]

set_property PACKAGE_PIN AD8 [get_ports {ddr3_addr[0]}]
set_property PACKAGE_PIN AC8 [get_ports {ddr3_addr[1]}]
set_property PACKAGE_PIN AA7 [get_ports {ddr3_addr[2]}]
set_property PACKAGE_PIN AA8 [get_ports {ddr3_addr[3]}]
set_property PACKAGE_PIN AF7 [get_ports {ddr3_addr[4]}]
set_property PACKAGE_PIN AE7 [get_ports {ddr3_addr[5]}]
set_property PACKAGE_PIN W8 [get_ports {ddr3_addr[6]}]
set_property PACKAGE_PIN V9 [get_ports {ddr3_addr[7]}]
set_property PACKAGE_PIN Y10 [get_ports {ddr3_addr[8]}]
set_property PACKAGE_PIN Y11 [get_ports {ddr3_addr[9]}]
set_property PACKAGE_PIN Y7 [get_ports {ddr3_addr[10]}]
set_property PACKAGE_PIN Y8 [get_ports {ddr3_addr[11]}]
set_property PACKAGE_PIN V7 [get_ports {ddr3_addr[12]}]
set_property PACKAGE_PIN V8 [get_ports {ddr3_addr[13]}]
set_property PACKAGE_PIN W11 [get_ports {ddr3_addr[14]}]
set_property PACKAGE_PIN V11 [get_ports {ddr3_addr[15]}]
set_property SLEW FAST [get_ports {ddr3_addr[*]}]
set_property IOSTANDARD SSTL15 [get_ports {ddr3_addr[*]}]

set_property PACKAGE_PIN AA9 [get_ports {ddr3_ba[0]}]
set_property PACKAGE_PIN AC7 [get_ports {ddr3_ba[1]}]
set_property PACKAGE_PIN AB7 [get_ports {ddr3_ba[2]}]
set_property SLEW FAST [get_ports {ddr3_ba[*]}]
set_property IOSTANDARD SSTL15 [get_ports {ddr3_ba[*]}]

set_property PACKAGE_PIN AB9 [get_ports {ddr3_ras_n}]
set_property SLEW FAST [get_ports {ddr3_ras_n}]
set_property IOSTANDARD SSTL15 [get_ports {ddr3_ras_n}]

set_property PACKAGE_PIN AC9 [get_ports {ddr3_cas_n}]
set_property SLEW FAST [get_ports {ddr3_cas_n}]
set_property IOSTANDARD SSTL15 [get_ports {ddr3_cas_n}]

set_property PACKAGE_PIN AD9 [get_ports {ddr3_we_n}]
set_property SLEW FAST [get_ports {ddr3_we_n}]
set_property IOSTANDARD SSTL15 [get_ports {ddr3_we_n}]

set_property PACKAGE_PIN AA2 [get_ports {ddr3_reset_n}]
set_property SLEW FAST [get_ports {ddr3_reset_n}]
set_property IOSTANDARD LVCMOS15 [get_ports {ddr3_reset_n}]

set_property PACKAGE_PIN AC12 [get_ports {ddr3_cke[0]}]
set_property PACKAGE_PIN AA12 [get_ports {ddr3_cke[1]}]
set_property SLEW FAST [get_ports {ddr3_cke[*]}]
set_property IOSTANDARD SSTL15 [get_ports {ddr3_cke[*]}]

set_property PACKAGE_PIN AA13 [get_ports {ddr3_odt[0]}]
set_property PACKAGE_PIN AD13 [get_ports {ddr3_odt[1]}]
set_property SLEW FAST [get_ports {ddr3_odt[*]}]
set_property IOSTANDARD SSTL15 [get_ports {ddr3_odt[*]}]

set_property PACKAGE_PIN AB12 [get_ports {ddr3_cs_n[0]}]
set_property PACKAGE_PIN AC13 [get_ports {ddr3_cs_n[1]}]
set_property SLEW FAST [get_ports {ddr3_cs_n[*]}]
set_property IOSTANDARD SSTL15 [get_ports {ddr3_cs_n[*]}]

set_property PACKAGE_PIN U6 [get_ports {ddr3_dm[0]}]
set_property PACKAGE_PIN Y3 [get_ports {ddr3_dm[1]}]
set_property PACKAGE_PIN AB6 [get_ports {ddr3_dm[2]}]
set_property PACKAGE_PIN AD4 [get_ports {ddr3_dm[3]}]
set_property SLEW FAST [get_ports {ddr3_dm[*]}]
set_property IOSTANDARD SSTL15 [get_ports {ddr3_dm[*]}]

set_property PACKAGE_PIN W6 [get_ports {ddr3_dqs_p[0]}]
set_property PACKAGE_PIN W5 [get_ports {ddr3_dqs_n[0]}]
set_property PACKAGE_PIN AB1 [get_ports {ddr3_dqs_p[1]}]
set_property PACKAGE_PIN AC1 [get_ports {ddr3_dqs_n[1]}]
set_property PACKAGE_PIN AA5 [get_ports {ddr3_dqs_p[2]}]
set_property PACKAGE_PIN AB5 [get_ports {ddr3_dqs_n[2]}]
set_property PACKAGE_PIN AF5 [get_ports {ddr3_dqs_p[3]}]
set_property PACKAGE_PIN AF4 [get_ports {ddr3_dqs_n[3]}]
set_property SLEW FAST [get_ports {ddr3_dqs*}]
set_property IOSTANDARD DIFF_SSTL15_T_DCI [get_ports {ddr3_dqs*}]

set_property PACKAGE_PIN W10 [get_ports {ddr3_ck_p[0]}]
set_property PACKAGE_PIN W9 [get_ports {ddr3_ck_n[0]}]
set_property SLEW FAST [get_ports {ddr3_ck*}]
set_property IOSTANDARD DIFF_SSTL15 [get_ports {ddr3_ck_*}]

# OnBoard 100Mhz MGTREFCLK #################################################
set_property PACKAGE_PIN K6 [get_ports {mgtrefclk_p}]
set_property PACKAGE_PIN K5 [get_ports {mgtrefclk_n}]

# 150 MHz
# input
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data_vld}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {dram_read_ready}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {dram_write_ready}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {execute}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {encrypt}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {generate_keys}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[0]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[1]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[2]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[3]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[4]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[5]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[6]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[7]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[8]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[9]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[10]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[11]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[12]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[13]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[14]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[15]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[16]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[17]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[18]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[19]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[20]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[21]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[22]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[23]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[24]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[25]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[26]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[27]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[28]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[29]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[30]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[31]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[32]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[33]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[34]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[35]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[36]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[37]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[38]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[39]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[40]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[41]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[42]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[43]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[44]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[45]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[46]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[47]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[48]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[49]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[50]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[51]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[52]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[53]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[54]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[55]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[56]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[57]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[58]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[59]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[60]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[61]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[62]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[63]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[64]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[65]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[66]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[67]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[68]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[69]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[70]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[71]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[72]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[73]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[74]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[75]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[76]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[77]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[78]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[79]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[80]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[81]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[82]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[83]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[84]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[85]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[86]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[87]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[88]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[89]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[90]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[91]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[92]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[93]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[94]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[95]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[96]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[97]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[98]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[99]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[100]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[101]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[102]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[103]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[104]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[105]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[106]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[107]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[108]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[109]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[110]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[111]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[112]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[113]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[114]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[115]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[116]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[117]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[118]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[119]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[120]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[121]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[122]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[123]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[124]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[125]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[126]}]
set_output_delay -min -clock [get_clocks clk] -3.2 [get_ports {data[127]}]

set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data_vld}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {dram_read_ready}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {dram_write_ready}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {execute}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {encrypt}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {generate_keys}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[0]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[1]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[2]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[3]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[4]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[5]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[6]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[7]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[8]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[9]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[10]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[11]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[12]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[13]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[14]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[15]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[16]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[17]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[18]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[19]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[20]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[21]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[22]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[23]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[24]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[25]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[26]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[27]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[28]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[29]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[30]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[31]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[32]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[33]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[34]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[35]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[36]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[37]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[38]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[39]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[40]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[41]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[42]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[43]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[44]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[45]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[46]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[47]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[48]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[49]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[50]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[51]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[52]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[53]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[54]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[55]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[56]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[57]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[58]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[59]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[60]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[61]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[62]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[63]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[64]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[65]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[66]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[67]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[68]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[69]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[70]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[71]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[72]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[73]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[74]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[75]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[76]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[77]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[78]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[79]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[80]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[81]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[82]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[83]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[84]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[85]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[86]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[87]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[88]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[89]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[90]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[91]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[92]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[93]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[94]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[95]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[96]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[97]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[98]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[99]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[100]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[101]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[102]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[103]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[104]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[105]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[106]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[107]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[108]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[109]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[110]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[111]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[112]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[113]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[114]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[115]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[116]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[117]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[118]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[119]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[120]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[121]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[122]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[123]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[124]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[125]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[126]}]
set_output_delay -max -clock [get_clocks clk] -1.1 [get_ports {data[127]}]

# #output
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {addr_wvalid}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {done}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {command_type}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[0]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[1]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[2]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[3]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[4]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[5]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[6]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[7]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[8]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[9]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[10]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[11]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[12]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[13]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[14]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[15]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[16]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[17]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[18]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {dram_addr[19]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[0]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[1]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[2]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[3]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[4]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[5]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[6]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[7]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[8]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[9]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[10]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[11]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[12]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[13]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[14]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[15]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[16]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[17]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[18]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[19]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[20]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[21]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[22]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[23]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[24]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[25]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[26]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[27]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[28]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[29]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[30]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[31]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[32]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[33]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[34]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[35]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[36]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[37]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[38]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[39]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[40]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[41]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[42]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[43]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[44]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[45]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[46]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[47]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[48]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[49]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[50]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[51]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[52]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[53]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[54]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[55]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[56]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[57]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[58]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[59]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[60]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[61]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[62]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[63]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[64]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[65]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[66]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[67]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[68]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[69]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[70]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[71]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[72]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[73]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[74]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[75]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[76]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[77]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[78]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[79]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[80]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[81]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[82]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[83]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[84]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[85]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[86]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[87]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[88]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[89]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[90]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[91]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[92]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[93]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[94]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[95]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[96]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[97]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[98]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[99]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[100]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[101]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[102]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[103]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[104]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[105]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[106]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[107]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[108]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[109]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[110]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[111]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[112]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[113]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[114]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[115]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[116]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[117]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[118]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[119]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[120]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[121]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[122]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[123]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[124]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[125]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[126]}]
# set_input_delay -min -clock [get_clocks clk] 0.0 [get_ports {data[127]}]

# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {addr_wvalid}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {done}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {command_type}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[0]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[1]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[2]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[3]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[4]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[5]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[6]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[7]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[8]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[9]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[10]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[11]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[12]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[13]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[14]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[15]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[16]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[17]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[18]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {dram_addr[19]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[0]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[1]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[2]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[3]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[4]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[5]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[6]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[7]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[8]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[9]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[10]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[11]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[12]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[13]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[14]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[15]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[16]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[17]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[18]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[19]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[20]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[21]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[22]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[23]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[24]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[25]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[26]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[27]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[28]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[29]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[30]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[31]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[32]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[33]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[34]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[35]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[36]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[37]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[38]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[39]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[40]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[41]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[42]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[43]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[44]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[45]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[46]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[47]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[48]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[49]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[50]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[51]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[52]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[53]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[54]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[55]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[56]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[57]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[58]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[59]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[60]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[61]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[62]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[63]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[64]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[65]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[66]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[67]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[68]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[69]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[70]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[71]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[72]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[73]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[74]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[75]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[76]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[77]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[78]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[79]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[80]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[81]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[82]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[83]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[84]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[85]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[86]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[87]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[88]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[89]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[90]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[91]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[92]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[93]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[94]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[95]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[96]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[97]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[98]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[99]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[100]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[101]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[102]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[103]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[104]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[105]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[106]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[107]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[108]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[109]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[110]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[111]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[112]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[113]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[114]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[115]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[116]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[117]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[118]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[119]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[120]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[121]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[122]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[123]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[124]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[125]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[126]}]
# set_input_delay -max -clock [get_clocks clk] 4.0 [get_ports {data[127]}]
